# Terminal
cask "ghostty"
brew "bash"
brew "bash-completion@2"
brew "mcfly"

# Git
brew "git"
brew "gh"
brew "stgit"

# Tools
brew "bat"
brew "curl"
brew "coreutils"
brew "gnu-sed"
brew "gnu-tar"
brew "ripgrep"
brew "jq"
brew "hey"
brew "pv"
brew "tokei"
brew "tree"
brew "yq"
brew "watch"
brew "micro"

# Security
brew "age"
brew "cfssl"
brew "gnupg"
brew "pinentry-mac"
brew "sops"
brew "step"

# Languages
brew "cue"
brew "go"
brew "gopls"
brew "golangci-lint"
brew "goreleaser"
brew "python"
brew "node"
brew "make"
brew "cmake"

# Kubernetes
brew "kubectl"
brew "kind"
brew "kubeconform"
brew "kustomize"
brew "helm"
brew "helm-docs"
tap "fluxcd/tap"
brew "fluxcd/tap/flux"
tap "controlplaneio-fluxcd/tap"
brew "controlplaneio-fluxcd/tap/flux-operator"
brew "controlplaneio-fluxcd/tap/flux-operator-mcp"
tap "stefanprodan/tap"
brew "stefanprodan/tap/timoni"

# OCI
brew "crane"
brew "cosign"
brew "trivy"

# Cloud
brew "awscli"
brew "eksctl"
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
tap "replicatedhq/replicated"
brew "replicatedhq/replicated/cli"

# AI
brew "gemini-cli"
cask "copilot-cli"
