# Terminal
cask "ghostty"
brew "bash"
brew "bash-completion@2"
brew "shellcheck"
brew "mcfly"
brew "tmux"

# Git
brew "git"
brew "gh"
brew "stgit"

# Tools
brew "bat"
brew "curl"
brew "coreutils"
brew "gnu-sed"
brew "gnu-tar"
brew "ripgrep"
brew "jq"
brew "hey"
brew "pv"
brew "tokei"
brew "tree"
brew "yq"
brew "watch"
brew "micro"
brew "pngquant"
brew "rclone"

# Security
cask "1password-cli"
brew "age"
brew "cfssl"
brew "gnupg"
brew "pinentry-mac"
brew "trufflehog"
brew "sops"
brew "step"
brew "zizmor"
brew "pinact"

# Languages
brew "cue"
brew "go"
brew "gopls"
brew "golangci-lint"
brew "goreleaser"
brew "python"
brew "uv"
brew "node"
brew "make"
brew "cmake"
brew "typescript"
tap "oven-sh/bun", trusted: true
brew "oven-sh/bun/bun"
brew "biome"

# Kubernetes
brew "kubectl"
brew "kind"
brew "kubeconform"
brew "kustomize"
brew "helm"
brew "helm-docs"
tap "fluxcd/tap", trusted: true
brew "fluxcd/tap/flux"
tap "controlplaneio-fluxcd/tap", trusted: true
brew "controlplaneio-fluxcd/tap/flux-operator"
brew "controlplaneio-fluxcd/tap/flux-operator-mcp"
tap "stefanprodan/tap", trusted: true
brew "stefanprodan/tap/timoni"

# OCI
brew "crane"
brew "cosign"
brew "trivy"
brew "grype"

# Cloud
brew "awscli"
brew "eksctl"
tap "hashicorp/tap", trusted: true
brew "hashicorp/tap/terraform"
tap "replicatedhq/replicated", trusted: true
brew "replicatedhq/replicated/cli"

# AI
brew "gemini-cli"
cask "copilot-cli"
